app/controllers/posts_controller.rb

  def show
    @reviews = Review.where(post_id: @post.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."post_id" = 2  ORDER BY created_at DESC
SELECT AVG("reviews"."rating") AS avg_id FROM "reviews"  WHERE "reviews"."post_id" = 2

  def create
    @post = current_user.posts.build(post_params)
      if @post.save
---
INSERT INTO "posts" ("caption", "created_at", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)