app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.post_id = @post.id
      if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "post_id", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Nice pics"], ["created_at", "2015-02-02 04:45:53.623351"], ["post_id", 2], ["rating", 4], ["updated_at", "2015-02-02 04:45:53.623351"], ["user_id", 1]]